--
--
--	UTF-8 file
--

if GetLocale() ~= "zhTW" then return end

Grail.holidayMapping = { ['A'] = '愛就在身邊', ['B'] = '啤酒節', ['C'] = "兒童週", ['D'] = '亡者節', ['F'] = '暗月馬戲團', ['H'] = '收穫節', ['L'] = '新年慶典', ['M'] = 'Midsummer Fire Festival', ['N'] = '貴族花園', ['P'] = "Pirates' Day", ['U'] = '除夕夜', ['V'] = '冬幕節', ['W'] = "萬鬼節", ['Y'] = "旅人豐年祭", }

Grail.professionMapping = { ['A'] = '鍊金術', ['B'] = '鍛造', ['C'] = '烹飪', ['E'] = '附魔', ['F'] = '釣魚', ['H'] = '草藥學', ['I'] = '銘文學', ['J'] = '珠寶設計', ['L'] = '製皮', ['M'] = '採礦', ['N'] = '工程學', ['P'] = 'Lockpicking', ['R'] = '騎術', ['S'] = '剝皮', ['T'] = '裁縫', ['U'] = 'Runeforging', ['X'] = '考古學', ['+'] = '急救', }

Grail.reputationMapping = {
	[01] = '達納蘇斯', [02] = '諾姆瑞根流亡者', [03] = '鐵爐堡', [04] = '暴風城', [05] = '艾克索達', [06] = '吉爾尼斯', [07] = '暗矛食人妖', [08] = '奧格瑪',
	[09] = '雷霆崖', [10] = '幽暗城', [11] = '銀月城', [12] = '污水企業', [13] = '阿拉索聯軍', [14] = '銀翼哨兵', [15] = '雷矛衛隊', [16] = '污染者',
	[17] = '霜狼氏族', [18] = '戰歌偵察騎兵', [19] = '藏寶海灣', [20] = '永望鎮', [21] = '加基森', [22] = '棘齒城', [23] = '塞納里奧遠征隊', [24] = '榮譽堡',
	[25] = '卡爾奈', [26] = "瑪格哈", [27] = "歐格利拉", [28] = '虛空之翼', [29] = '斯博格爾', [30] = '聯合團', [31] = '索爾瑪', [32] = '陰鬱城',
	[33] = "薩塔禦天者", [34] = '破碎之日進攻部隊', [35] = '奧多爾', [36] = '占卜者', [37] = "薩塔", [38] = '聯盟先鋒', [39] = '銀白十字軍', [40] = "探險者協會",
	[41] = '狂心部族', [42] = '霜誕矮人', [43] = '復仇之手', [44] = '部落遠征軍', [45] = "卡魯耶克", [46] = '黯刃騎士團', [47] = '神諭者', [48] = '霍迪爾之子',
	[49] = '坦卡族', [50] = '驍勇遠征隊', [51] = '戰歌進攻部隊', [52] = '龍眠協調者', [53] = '祈倫托', [54] = '白銀誓盟', [55] = '奪日者', [56] = '海加爾守護者',
	[57] = '陶土議會', [58] = '瑟拉贊恩', [59] = '灰燼裁決軍', [60] = '灰舌死亡誓言者', [61] = '諾茲多姆的子嗣', [62] = '塞納里奧議會', [63] = '海達希亞水元素', [64] = '流沙之鱗',
	[65] = '贊達拉部族', [66] = '銀色黎明', [67] = '血帆海盜', [68] = '暗月馬戲團', [69] = '吉爾吉斯半人馬', [70] = '時光守望者', [71] = '瑪格拉姆半人馬', [72] = '拉文霍德',
	[73] = "辛德拉", [74] = '辛迪加', [75] = '瑟銀兄弟會', [76] = '木喉要塞', [77] = '安寧地', [78] = '紫羅蘭之眼', [79] = '冬刃豹訓練師', [80] = '蠻錘氏族',
	[81] = '蘭姆卡韓',
	}
