--
--
--	UTF-8 file
--

if GetLocale() ~= "ruRU" then return end

Grail.holidayMapping = { ['A'] = 'Любовная лихорадка', ['B'] = 'Хмельной фестиваль', ['C'] = "Детская неделя", ['D'] = 'День мертвых', ['F'] = 'Ярмарка Новолуния', ['H'] = 'Неделя урожая', ['L'] = 'Лунный фестиваль', ['M'] = 'Midsummer Fire Festival', ['N'] = 'Сад чудес', ['P'] = "Pirates' Day", ['U'] = 'Канун Нового Года', ['V'] = 'Зимний Покров', ['W'] = "Тыквовин", ['Y'] = "Пиршество странников", }

Grail.professionMapping = { ['A'] = 'Алхимия', ['B'] = 'Кузнечное дело', ['C'] = 'Кулинария', ['E'] = 'Наложение чар', ['F'] = 'Рыбная ловля', ['H'] = 'Травничество', ['I'] = 'Начертание', ['J'] = 'Ювелирное дело', ['L'] = 'Кожевничество', ['M'] = 'Горное дело', ['N'] = 'Механика', ['P'] = 'Lockpicking', ['R'] = 'Верховая езда', ['S'] = 'Снятие шкур', ['T'] = 'Портняжное дело', ['U'] = 'Runeforging', ['X'] = 'Археология', ['+'] = 'Первая помощь', }

Grail.reputationMapping = {
	[01] = 'Дарнас', [02] = 'Изгнанники Гномрегана', [03] = 'Стальгорн', [04] = 'Штормград', [05] = 'Экзодар', [06] = 'Гилнеас', [07] = 'Тролли Черного Копья', [08] = 'Оргриммар',
	[09] = 'Громовой Утес', [10] = 'Подгород', [11] = 'Луносвет', [12] = 'Картель Трюмных Вод', [13] = 'Лига Аратора', [14] = 'Среброкрылые Часовые', [15] = 'Стража Грозовой Вершины', [16] = 'Осквернители',
	[17] = 'Клан Северного Волка', [18] = 'Всадники Песни Войны', [19] = 'Пиратская бухта', [20] = 'Круговзор', [21] = 'Прибамбасск', [22] = 'Кабестан', [23] = 'Экспедиция Ценариона', [24] = 'Оплот Чести',
	[25] = 'Куренай', [26] = "Маг'хары", [27] = "Огри'ла", [28] = 'Крылья Пустоты', [29] = 'Спореггар', [30] = 'Консорциум', [31] = 'Траллмар', [32] = 'Нижний Город',
	[33] = "Стражи Небес Ша'тар", [34] = 'Армия Расколотого Солнца', [35] = 'Алдоры', [36] = 'Провидцы', [37] = "Ша'тар", [38] = 'Авангард Альянса', [39] = 'Серебряный Авангард', [40] = "Лига исследователей",
	[41] = 'Племя Мятежного Сердца', [42] = 'Зиморожденные', [43] = 'Карающая длань', [44] = 'Экспедиция Орды', [45] = "Калу'ак", [46] = 'Рыцари Черного Клинка', [47] = 'Оракулы', [48] = 'Сыновья Ходира',
	[49] = 'Таунка', [50] = 'Экспедиция Отважных', [51] = 'Армия Песни Войны', [52] = 'Драконий союз', [53] = 'Кирин-Тор', [54] = 'Серебряный Союз', [55] = 'Похитители солнца', [56] = 'Стражи Хиджала',
	[57] = 'Служители Земли', [58] = 'Теразан', [59] = 'Пепельный союз', [60] = 'Пеплоусты-служители', [61] = 'Род Ноздорму', [62] = 'Круг Кенария', [63] = 'Гидраксианские Повелители Вод', [64] = 'Песчаная Чешуя',
	[65] = 'Племя Зандалар', [66] = 'Серебряный Рассвет', [67] = 'Пираты Кровавого Паруса', [68] = 'Ярмарка Новолуния', [69] = 'Кентавры из племени Гелкис', [70] = 'Хранители Времени', [71] = 'Кентавры из племени Маграм', [72] = 'Черный Ворон',
	[73] = "Шен'дралар", [74] = 'Синдикат', [75] = 'Братство Тория', [76] = 'Древобрюхи', [77] = 'Транквиллион', [78] = 'Аметистовое Око', [79] = 'Укротители ледопардов', [80] = 'Неистовый Молот',
	[81] = 'Рамкахены',
	}
