--
--
--	UTF-8 file
--

if GetLocale() ~= "zhCN" then return end

Grail.holidayMapping = { ['A'] = '情人节', ['B'] = '美酒节', ['C'] = "儿童周", ['D'] = '死人节', ['F'] = '暗月马戏团', ['H'] = '收获节', ['L'] = '春节', ['M'] = 'Midsummer Fire Festival', ['N'] = '复活节', ['P'] = "Pirates' Day", ['U'] = '除夕夜', ['V'] = '冬幕节', ['W'] = "万圣节", ['Y'] = "感恩节", }

Grail.professionMapping = { ['A'] = '炼金术', ['B'] = '锻造', ['C'] = '烹饪', ['E'] = '附魔', ['F'] = '钓鱼', ['H'] = '草药学', ['I'] = '铭文', ['J'] = '珠宝加工', ['L'] = '制皮', ['M'] = '采矿', ['N'] = '工程学', ['P'] = 'Lockpicking', ['R'] = '骑术', ['S'] = '剥皮', ['T'] = '裁缝', ['U'] = 'Runeforging', ['X'] = 'Archaeology', ['+'] = '急救', }

Grail.reputationMapping = {
	[01] = '达纳苏斯', [02] = '诺莫瑞根流亡者', [03] = '铁炉堡', [04] = '暴风城', [05] = '埃索达', [06] = 'Gilneas', [07] = '暗矛巨魔', [08] = '奥格瑞玛',
	[09] = '雷霆崖', [10] = '幽暗城', [11] = '银月城', [12] = 'Bilgewater Cartel', [13] = '阿拉索联军', [14] = '银翼哨兵', [15] = '雷矛卫队', [16] = '污染者',
	[17] = '霜狼氏族', [18] = '战歌侦察骑兵', [19] = '藏宝海湾', [20] = '永望镇', [21] = '加基森', [22] = '棘齿城', [23] = '塞纳里奥远征队', [24] = '荣耀堡',
	[25] = '库雷尼', [26] = "玛格汉", [27] = "奥格瑞拉", [28] = '灵翼之龙', [29] = '孢子村', [30] = '星界财团', [31] = '萨尔玛', [32] = '贫民窟',
	[33] = "沙塔尔天空卫士", [34] = '破碎残阳', [35] = '奥尔多', [36] = '占星者', [37] = "沙塔尔", [38] = '联盟先遣军', [39] = '银色北伐军', [40] = "探险者协会",
	[41] = '狂心氏族', [42] = '霜脉矮人', [43] = '复仇之手', [44] = '部落先遣军', [45] = "卡鲁亚克", [46] = '黑锋骑士团', [47] = '神谕者', [48] = '霍迪尔之子',
	[49] = '牦牛人', [50] = '无畏远征军', [51] = '战歌远征军', [52] = '龙眠联军', [53] = '肯瑞托', [54] = '银色盟约', [55] = '夺日者', [56] = 'Guardians of Hyjal',
	[57] = 'The Earthen Ring', [58] = 'Therazane', [59] = '灰烬审判军', [60] = '灰舌死誓者', [61] = '诺兹多姆的子嗣', [62] = '塞纳里奥议会', [63] = '海达希亚水元素', [64] = '流沙之鳞',
	[65] = '赞达拉部族', [66] = '银色黎明', [67] = '血帆海盗', [68] = '暗月马戏团', [69] = '吉尔吉斯半人马', [70] = '时光守护者', [71] = '玛格拉姆半人马', [72] = '拉文霍德',
	[73] = "辛德拉", [74] = '辛迪加', [75] = '瑟银兄弟会', [76] = '木喉要塞', [77] = '塔奎林', [78] = '紫罗兰之眼', [79] = '冬刃豹训练师', [80] = '蛮锤部族',
	[81] = '拉穆卡恒',
	}
