--
--
--	UTF-8 file
--

if GetLocale() ~= "koKR" then return end

Grail.holidayMapping = { ['A'] = '온누리에 사랑을', ['B'] = '가을 축제', ['C'] = "어린이 주간", ['D'] = '망자의 날', ['F'] = '다크문 축제', ['H'] = '추수절', ['L'] = '달의 축제', ['M'] = 'Midsummer Fire Festival', ['N'] = '귀족의 정원', ['P'] = "Pirates' Day", ['U'] = '새해맞이 전야제', ['V'] = '겨울맞이 축제', ['W'] = "할로윈 축제", ['Y'] = "순례자의 감사절", }

Grail.professionMapping = { ['A'] = '연금술', ['B'] = '대장기술', ['C'] = '요리', ['E'] = '마법부여', ['F'] = '낚시', ['H'] = '약초채집', ['I'] = '주문각인', ['J'] = '보석세공', ['L'] = '가죽세공', ['M'] = '채광', ['N'] = '기계공학', ['P'] = 'Lockpicking', ['R'] = '탈것 숙련', ['S'] = '무두질', ['T'] = '재봉술', ['U'] = 'Runeforging', ['X'] = '고고학', ['+'] = '응급치료', }

Grail.reputationMapping = {
	[01] = '다르나서스', [02] = '놈리건', [03] = '아이언포지', [04] = '스톰윈드', [05] = '엑소다르', [06] = '길니아스', [07] = '검은창 트롤', [08] = '오그리마',
	[09] = '썬더 블러프', [10] = '언더시티', [11] = '실버문', [12] = '빌지워터 무역회사', [13] = '아라소르 연맹', [14] = '은빛날개 파수대', [15] = '스톰파이크 경비대', [16] = '포세이큰 파멸단',
	[17] = '서리늑대 부족', [18] = '전쟁노래 정찰대', [19] = '무법항', [20] = '눈망루 마을', [21] = '가젯잔', [22] = '톱니항', [23] = '세나리온 원정대', [24] = '명예의 요새',
	[25] = '쿠레나이', [26] = "마그하르", [27] = "오그릴라", [28] = '황천의 용군단', [29] = '스포어가르', [30] = '무역연합', [31] = '스랄마', [32] = '고난의 거리',
	[33] = "샤타리 하늘경비대", [34] = '무너진 태양 공격대', [35] = '알도르 사제회', [36] = '점술가 길드', [37] = "샤타르", [38] = '얼라이언스 선봉대', [39] = '은빛십자군', [40] = "탐험가 연맹",
	[41] = '광란의심장일족', [42] = '서릿결부족 드워프', [43] = '복수의 대리인', [44] = '호드 원정대', [45] = "칼루아크", [46] = '칠흑의 기사단', [47] = '점쟁이 조합', [48] = '호디르의 후예',
	[49] = '타운카', [50] = '용맹의 원정대', [51] = '전쟁노래 공격대', [52] = '고룡쉼터 사원 용군단', [53] = '키린 토', [54] = '은빛 서약단', [55] = '선리버', [56] = '하이잘의 수호자',
	[57] = '대지 고리회', [58] = '테라제인', [59] = '잿빛 선고단', [60] = '잿빛혓바닥 결사단', [61] = '노즈도르무 혈족', [62] = '세나리온 의회', [63] = '히드락시안 물의 군주', [64] = '시간의 중재자',
	[65] = '잔달라 부족', [66] = '은빛 여명회', [67] = '붉은 해적단', [68] = '다크문 유랑단', [69] = '겔키스 부족 켄타로우스', [70] = '시간의 수호자', [71] = '마그람 부족 켄타로우스', [72] = '라벤홀트',
	[73] = "센드렐라", [74] = '비밀결사대', [75] = '토륨 대장조합', [76] = '나무구렁 요새', [77] = '트랜퀼리엔', [78] = '보랏빛 눈의 감시자', [79] = '눈호랑이 조련사', [80] = '와일드해머 부족',
	[81] = '람카헨',
	}
